<!-- add-pr-comment:dev-tfplan -->

Terraform plan output for dev

```text


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aurora.aws_iam_role.enhanced_monitoring will be created
  + resource "aws_iam_role" "enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "arc-poc-enhanced-monitoring-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "arc-poc-enhanced-monitoring-role"
          + "Project"      = "arc-training-debash"
        }
      + tags_all              = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "arc-poc-enhanced-monitoring-role"
          + "Project"      = "arc-training-debash"
        }
      + unique_id             = (known after apply)
    }

  # module.aurora.aws_iam_role_policy_attachment.enhanced_monitoring will be created
  + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = "arc-poc-enhanced-monitoring-role"
    }

  # module.aurora.aws_kms_alias.aurora_cluster_kms_key[0] will be created
  + resource "aws_kms_alias" "aurora_cluster_kms_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/arc-poc-aurora-cluster-kms-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.aurora.aws_kms_key.aurora_cluster_kms_key[0] will be created
  + resource "aws_kms_key" "aurora_cluster_kms_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "Aurora cluster KMS key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "arc-poc-aurora-cluster-kms-key"
          + "Project"      = "arc-training-debash"
        }
      + tags_all                           = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "arc-poc-aurora-cluster-kms-key"
          + "Project"      = "arc-training-debash"
        }
    }

  # module.aurora.aws_ssm_parameter.this["/arc/poc/training/cluster_admin_db_password"] will be created
  + resource "aws_ssm_parameter" "this" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Managed by Terraform"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arc/poc/training/cluster_admin_db_password"
      + overwrite      = true
      + tags           = {
          + "AuroraName"   = "arc-poc-db-cluster-ssm-param"
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Project"      = "arc-training-debash"
        }
      + tags_all       = {
          + "AuroraName"   = "arc-poc-db-cluster-ssm-param"
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Project"      = "arc-training-debash"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aurora.aws_ssm_parameter.this["/arc/poc/training/cluster_admin_db_username"] will be created
  + resource "aws_ssm_parameter" "this" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Managed by Terraform"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arc/poc/training/cluster_admin_db_username"
      + overwrite      = true
      + tags           = {
          + "AuroraName"   = "arc-poc-db-cluster-ssm-param"
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Project"      = "arc-training-debash"
        }
      + tags_all       = {
          + "AuroraName"   = "arc-poc-db-cluster-ssm-param"
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Project"      = "arc-training-debash"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aurora.aws_ssm_parameter.this["/arc/poc/training/cluster_endpoint"] will be created
  + resource "aws_ssm_parameter" "this" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Managed by Terraform"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arc/poc/training/cluster_endpoint"
      + overwrite      = true
      + tags           = {
          + "AuroraName"   = "arc-poc-db-cluster-ssm-param"
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Project"      = "arc-training-debash"
        }
      + tags_all       = {
          + "AuroraName"   = "arc-poc-db-cluster-ssm-param"
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Project"      = "arc-training-debash"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aurora.random_password.aurora_db_admin_password[0] will be created
  + resource "random_password" "aurora_db_admin_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 41
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#*^"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.aurora.module.aurora_cluster[0].aws_db_parameter_group.default[0] will be created
  + resource "aws_db_parameter_group" "default" {
      + arn         = (known after apply)
      + description = "DB instance parameter group"
      + family      = "aurora-postgresql14"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "arc-poc-training-"
      + tags        = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "training"
          + "Namespace"    = "arc"
          + "Project"      = "arc-training-debash"
          + "Stage"        = "poc"
        }
      + tags_all    = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "training"
          + "Namespace"    = "arc"
          + "Project"      = "arc-training-debash"
          + "Stage"        = "poc"
        }
    }

  # module.aurora.module.aurora_cluster[0].aws_db_subnet_group.default[0] will be created
  + resource "aws_db_subnet_group" "default" {
      + arn                     = (known after apply)
      + description             = "Allowed subnets for DB cluster instances"
      + id                      = (known after apply)
      + name                    = "arc-poc-training"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-047eca1b1f0d3f16f",
          + "subnet-078300c4ef25dda18",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "training"
          + "Namespace"    = "arc"
          + "Project"      = "arc-training-debash"
          + "Stage"        = "poc"
        }
      + tags_all                = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "training"
          + "Namespace"    = "arc"
          + "Project"      = "arc-training-debash"
          + "Stage"        = "poc"
        }
      + vpc_id                  = (known after apply)
    }

  # module.aurora.module.aurora_cluster[0].aws_rds_cluster.primary[0] will be created
  + resource "aws_rds_cluster" "primary" {
      + allocated_storage                   = (known after apply)
      + allow_major_version_upgrade         = false
      + apply_immediately                   = true
      + arn                                 = (known after apply)
      + availability_zones                  = (known after apply)
      + backtrack_window                    = 0
      + backup_retention_period             = 5
      + cluster_identifier                  = "arc-poc-training"
      + cluster_identifier_prefix           = (known after apply)
      + cluster_members                     = (known after apply)
      + cluster_resource_id                 = (known after apply)
      + copy_tags_to_snapshot               = true
      + database_name                       = "training"
      + db_cluster_parameter_group_name     = (known after apply)
      + db_subnet_group_name                = "arc-poc-training"
      + deletion_protection                 = false
      + enable_global_write_forwarding      = false
      + enable_http_endpoint                = false
      + endpoint                            = (known after apply)
      + engine                              = "aurora-postgresql"
      + engine_mode                         = "provisioned"
      + engine_version                      = "14.5"
      + engine_version_actual               = (known after apply)
      + final_snapshot_identifier           = "arc-poc-training"
      + hosted_zone_id                      = (known after apply)
      + iam_database_authentication_enabled = false
      + iam_roles                           = (known after apply)
      + id                                  = (known after apply)
      + kms_key_id                          = (known after apply)
      + master_password                     = (sensitive value)
      + master_user_secret                  = (known after apply)
      + master_user_secret_kms_key_id       = (known after apply)
      + master_username                     = "db_admin"
      + network_type                        = (known after apply)
      + port                                = (known after apply)
      + preferred_backup_window             = "07:00-09:00"
      + preferred_maintenance_window        = "wed:03:00-wed:04:00"
      + reader_endpoint                     = (known after apply)
      + skip_final_snapshot                 = true
      + storage_encrypted                   = true
      + storage_type                        = (known after apply)
      + tags                                = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "training"
          + "Namespace"    = "arc"
          + "Project"      = "arc-training-debash"
          + "Stage"        = "poc"
        }
      + tags_all                            = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "training"
          + "Namespace"    = "arc"
          + "Project"      = "arc-training-debash"
          + "Stage"        = "poc"
        }
      + vpc_security_group_ids              = (known after apply)
        # (2 unchanged attributes hidden)

      + serverlessv2_scaling_configuration {
          + max_capacity = 16
          + min_capacity = 2
        }
    }

  # module.aurora.module.aurora_cluster[0].aws_rds_cluster_parameter_group.default[0] will be created
  + resource "aws_rds_cluster_parameter_group" "default" {
      + arn         = (known after apply)
      + description = "DB cluster parameter group"
      + family      = "aurora-postgresql14"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "arc-poc-training-"
      + tags        = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "training"
          + "Namespace"    = "arc"
          + "Project"      = "arc-training-debash"
          + "Stage"        = "poc"
        }
      + tags_all    = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "training"
          + "Namespace"    = "arc"
          + "Project"      = "arc-training-debash"
          + "Stage"        = "poc"
        }
    }

  # module.aurora.module.aurora_cluster[0].aws_security_group.default[0] will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic from Security Groups and CIDRs"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "arc-poc-training"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "training"
          + "Namespace"    = "arc"
          + "Project"      = "arc-training-debash"
          + "Stage"        = "poc"
        }
      + tags_all               = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "training"
          + "Namespace"    = "arc"
          + "Project"      = "arc-training-debash"
          + "Stage"        = "poc"
        }
      + vpc_id                 = "vpc-02bc96b47bf3f7d66"
    }

  # module.aurora.module.aurora_cluster[0].aws_security_group_rule.egress[0] will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.aurora.module.aurora_cluster[0].aws_security_group_rule.ingress_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_cidr_blocks" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Allow inbound traffic from existing CIDR blocks"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + db_admin_username = "db_admin"

```

